grevaillot/svd_tools/headers/STM32F7x7/can3.h
#pragma once 

/* --- CAN3: Controller area network -------------------------------- */

/** @defgroup can3_registers Controller area network Register
@{*/

/** CAN3_MCR master control register **/
#define CAN3_MCR			MMIO32(CAN3_BASE + 0x00)
/** CAN3_MSR master status register **/
#define CAN3_MSR			MMIO32(CAN3_BASE + 0x04)
/** CAN3_TSR transmit status register **/
#define CAN3_TSR			MMIO32(CAN3_BASE + 0x08)
/** CAN3_RF0R receive FIFO 0 register **/
#define CAN3_RF0R			MMIO32(CAN3_BASE + 0x0c)
/** CAN3_RF1R receive FIFO 1 register **/
#define CAN3_RF1R			MMIO32(CAN3_BASE + 0x10)
/** CAN3_IER interrupt enable register **/
#define CAN3_IER			MMIO32(CAN3_BASE + 0x14)
/** CAN3_ESR interrupt enable register **/
#define CAN3_ESR			MMIO32(CAN3_BASE + 0x18)
/** CAN3_BTR bit timing register **/
#define CAN3_BTR			MMIO32(CAN3_BASE + 0x1c)
/** CAN3_TI0R TX mailbox identifier register **/
#define CAN3_TI0R			MMIO32(CAN3_BASE + 0x180)
/** CAN3_TDT0R mailbox data length control and time stamp register **/
#define CAN3_TDT0R			MMIO32(CAN3_BASE + 0x184)
/** CAN3_TDL0R mailbox data low register **/
#define CAN3_TDL0R			MMIO32(CAN3_BASE + 0x188)
/** CAN3_TDH0R mailbox data high register **/
#define CAN3_TDH0R			MMIO32(CAN3_BASE + 0x18c)
/** CAN3_TI1R mailbox identifier register **/
#define CAN3_TI1R			MMIO32(CAN3_BASE + 0x190)
/** CAN3_TDT1R mailbox data length control and time stamp register **/
#define CAN3_TDT1R			MMIO32(CAN3_BASE + 0x194)
/** CAN3_TDL1R mailbox data low register **/
#define CAN3_TDL1R			MMIO32(CAN3_BASE + 0x198)
/** CAN3_TDH1R mailbox data high register **/
#define CAN3_TDH1R			MMIO32(CAN3_BASE + 0x19c)
/** CAN3_TI2R mailbox identifier register **/
#define CAN3_TI2R			MMIO32(CAN3_BASE + 0x1a0)
/** CAN3_TDT2R mailbox data length control and time stamp register **/
#define CAN3_TDT2R			MMIO32(CAN3_BASE + 0x1a4)
/** CAN3_TDL2R mailbox data low register **/
#define CAN3_TDL2R			MMIO32(CAN3_BASE + 0x1a8)
/** CAN3_TDH2R mailbox data high register **/
#define CAN3_TDH2R			MMIO32(CAN3_BASE + 0x1ac)
/** CAN3_RI0R receive FIFO mailbox identifier register **/
#define CAN3_RI0R			MMIO32(CAN3_BASE + 0x1b0)
/** CAN3_RDT0R mailbox data high register **/
#define CAN3_RDT0R			MMIO32(CAN3_BASE + 0x1b4)
/** CAN3_RDL0R mailbox data high register **/
#define CAN3_RDL0R			MMIO32(CAN3_BASE + 0x1b8)
/** CAN3_RDH0R receive FIFO mailbox data high register **/
#define CAN3_RDH0R			MMIO32(CAN3_BASE + 0x1bc)
/** CAN3_RI1R mailbox data high register **/
#define CAN3_RI1R			MMIO32(CAN3_BASE + 0x1c0)
/** CAN3_RDT1R mailbox data high register **/
#define CAN3_RDT1R			MMIO32(CAN3_BASE + 0x1c4)
/** CAN3_RDL1R mailbox data high register **/
#define CAN3_RDL1R			MMIO32(CAN3_BASE + 0x1c8)
/** CAN3_RDH1R mailbox data high register **/
#define CAN3_RDH1R			MMIO32(CAN3_BASE + 0x1cc)
/** CAN3_FMR filter master register **/
#define CAN3_FMR			MMIO32(CAN3_BASE + 0x200)
/** CAN3_FM1R filter mode register **/
#define CAN3_FM1R			MMIO32(CAN3_BASE + 0x204)
/** CAN3_FS1R filter scale register **/
#define CAN3_FS1R			MMIO32(CAN3_BASE + 0x20c)
/** CAN3_FFA1R filter FIFO assignment register **/
#define CAN3_FFA1R			MMIO32(CAN3_BASE + 0x214)
/** CAN3_FA1R filter activation register **/
#define CAN3_FA1R			MMIO32(CAN3_BASE + 0x21c)
/** CAN3_F0R1 Filter bank 0 register 1 **/
#define CAN3_F0R1			MMIO32(CAN3_BASE + 0x240)
/** CAN3_F0R2 Filter bank 0 register 2 **/
#define CAN3_F0R2			MMIO32(CAN3_BASE + 0x244)
/** CAN3_F1R1 Filter bank 1 register 1 **/
#define CAN3_F1R1			MMIO32(CAN3_BASE + 0x248)
/** CAN3_F1R2 Filter bank 1 register 2 **/
#define CAN3_F1R2			MMIO32(CAN3_BASE + 0x24c)
/** CAN3_F2R1 Filter bank 2 register 1 **/
#define CAN3_F2R1			MMIO32(CAN3_BASE + 0x250)
/** CAN3_F2R2 Filter bank 2 register 2 **/
#define CAN3_F2R2			MMIO32(CAN3_BASE + 0x254)
/** CAN3_F3R1 Filter bank 3 register 1 **/
#define CAN3_F3R1			MMIO32(CAN3_BASE + 0x258)
/** CAN3_F3R2 Filter bank 3 register 2 **/
#define CAN3_F3R2			MMIO32(CAN3_BASE + 0x25c)
/** CAN3_F4R1 Filter bank 4 register 1 **/
#define CAN3_F4R1			MMIO32(CAN3_BASE + 0x260)
/** CAN3_F4R2 Filter bank 4 register 2 **/
#define CAN3_F4R2			MMIO32(CAN3_BASE + 0x264)
/** CAN3_F5R1 Filter bank 5 register 1 **/
#define CAN3_F5R1			MMIO32(CAN3_BASE + 0x268)
/** CAN3_F5R2 Filter bank 5 register 2 **/
#define CAN3_F5R2			MMIO32(CAN3_BASE + 0x26c)
/** CAN3_F6R1 Filter bank 6 register 1 **/
#define CAN3_F6R1			MMIO32(CAN3_BASE + 0x270)
/** CAN3_F6R2 Filter bank 6 register 2 **/
#define CAN3_F6R2			MMIO32(CAN3_BASE + 0x274)
/** CAN3_F7R1 Filter bank 7 register 1 **/
#define CAN3_F7R1			MMIO32(CAN3_BASE + 0x278)
/** CAN3_F7R2 Filter bank 7 register 2 **/
#define CAN3_F7R2			MMIO32(CAN3_BASE + 0x27c)
/** CAN3_F8R1 Filter bank 8 register 1 **/
#define CAN3_F8R1			MMIO32(CAN3_BASE + 0x280)
/** CAN3_F8R2 Filter bank 8 register 2 **/
#define CAN3_F8R2			MMIO32(CAN3_BASE + 0x284)
/** CAN3_F9R1 Filter bank 9 register 1 **/
#define CAN3_F9R1			MMIO32(CAN3_BASE + 0x288)
/** CAN3_F9R2 Filter bank 9 register 2 **/
#define CAN3_F9R2			MMIO32(CAN3_BASE + 0x28c)
/** CAN3_F10R1 Filter bank 10 register 1 **/
#define CAN3_F10R1			MMIO32(CAN3_BASE + 0x290)
/** CAN3_F10R2 Filter bank 10 register 2 **/
#define CAN3_F10R2			MMIO32(CAN3_BASE + 0x294)
/** CAN3_F11R1 Filter bank 11 register 1 **/
#define CAN3_F11R1			MMIO32(CAN3_BASE + 0x298)
/** CAN3_F11R2 Filter bank 11 register 2 **/
#define CAN3_F11R2			MMIO32(CAN3_BASE + 0x29c)
/** CAN3_F12R1 Filter bank 4 register 1 **/
#define CAN3_F12R1			MMIO32(CAN3_BASE + 0x2a0)
/** CAN3_F12R2 Filter bank 12 register 2 **/
#define CAN3_F12R2			MMIO32(CAN3_BASE + 0x2a4)
/** CAN3_F13R1 Filter bank 13 register 1 **/
#define CAN3_F13R1			MMIO32(CAN3_BASE + 0x2a8)
/** CAN3_F13R2 Filter bank 13 register 2 **/
#define CAN3_F13R2			MMIO32(CAN3_BASE + 0x2ac)
/** CAN3_F14R1 Filter bank 14 register 1 **/
#define CAN3_F14R1			MMIO32(CAN3_BASE + 0x2b0)
/** CAN3_F14R2 Filter bank 14 register 2 **/
#define CAN3_F14R2			MMIO32(CAN3_BASE + 0x2b4)
/** CAN3_F15R1 Filter bank 15 register 1 **/
#define CAN3_F15R1			MMIO32(CAN3_BASE + 0x2b8)
/** CAN3_F15R2 Filter bank 15 register 2 **/
#define CAN3_F15R2			MMIO32(CAN3_BASE + 0x2bc)
/** CAN3_F16R1 Filter bank 16 register 1 **/
#define CAN3_F16R1			MMIO32(CAN3_BASE + 0x2c0)
/** CAN3_F16R2 Filter bank 16 register 2 **/
#define CAN3_F16R2			MMIO32(CAN3_BASE + 0x2c4)
/** CAN3_F17R1 Filter bank 17 register 1 **/
#define CAN3_F17R1			MMIO32(CAN3_BASE + 0x2c8)
/** CAN3_F17R2 Filter bank 17 register 2 **/
#define CAN3_F17R2			MMIO32(CAN3_BASE + 0x2cc)
/** CAN3_F18R1 Filter bank 18 register 1 **/
#define CAN3_F18R1			MMIO32(CAN3_BASE + 0x2d0)
/** CAN3_F18R2 Filter bank 18 register 2 **/
#define CAN3_F18R2			MMIO32(CAN3_BASE + 0x2d4)
/** CAN3_F19R1 Filter bank 19 register 1 **/
#define CAN3_F19R1			MMIO32(CAN3_BASE + 0x2d8)
/** CAN3_F19R2 Filter bank 19 register 2 **/
#define CAN3_F19R2			MMIO32(CAN3_BASE + 0x2dc)
/** CAN3_F20R1 Filter bank 20 register 1 **/
#define CAN3_F20R1			MMIO32(CAN3_BASE + 0x2e0)
/** CAN3_F20R2 Filter bank 20 register 2 **/
#define CAN3_F20R2			MMIO32(CAN3_BASE + 0x2e4)
/** CAN3_F21R1 Filter bank 21 register 1 **/
#define CAN3_F21R1			MMIO32(CAN3_BASE + 0x2e8)
/** CAN3_F21R2 Filter bank 21 register 2 **/
#define CAN3_F21R2			MMIO32(CAN3_BASE + 0x2ec)
/** CAN3_F22R1 Filter bank 22 register 1 **/
#define CAN3_F22R1			MMIO32(CAN3_BASE + 0x2f0)
/** CAN3_F22R2 Filter bank 22 register 2 **/
#define CAN3_F22R2			MMIO32(CAN3_BASE + 0x2f4)
/** CAN3_F23R1 Filter bank 23 register 1 **/
#define CAN3_F23R1			MMIO32(CAN3_BASE + 0x2f8)
/** CAN3_F23R2 Filter bank 23 register 2 **/
#define CAN3_F23R2			MMIO32(CAN3_BASE + 0x2fc)
/** CAN3_F24R1 Filter bank 24 register 1 **/
#define CAN3_F24R1			MMIO32(CAN3_BASE + 0x300)
/** CAN3_F24R2 Filter bank 24 register 2 **/
#define CAN3_F24R2			MMIO32(CAN3_BASE + 0x304)
/** CAN3_F25R1 Filter bank 25 register 1 **/
#define CAN3_F25R1			MMIO32(CAN3_BASE + 0x308)
/** CAN3_F25R2 Filter bank 25 register 2 **/
#define CAN3_F25R2			MMIO32(CAN3_BASE + 0x30c)
/** CAN3_F26R1 Filter bank 26 register 1 **/
#define CAN3_F26R1			MMIO32(CAN3_BASE + 0x310)
/** CAN3_F26R2 Filter bank 26 register 2 **/
#define CAN3_F26R2			MMIO32(CAN3_BASE + 0x314)
/** CAN3_F27R1 Filter bank 27 register 1 **/
#define CAN3_F27R1			MMIO32(CAN3_BASE + 0x318)
/** CAN3_F27R2 Filter bank 27 register 2 **/
#define CAN3_F27R2			MMIO32(CAN3_BASE + 0x31c)

/**@}*/


/** @defgroup can3_mcr MCR master control register
@{*/

/** CAN3_MCR_DBF DBF **/
#define CAN3_MCR_DBF		(1 << 16)
/** CAN3_MCR_RESET RESET **/
#define CAN3_MCR_RESET		(1 << 15)
/** CAN3_MCR_TTCM TTCM **/
#define CAN3_MCR_TTCM		(1 << 7)
/** CAN3_MCR_ABOM ABOM **/
#define CAN3_MCR_ABOM		(1 << 6)
/** CAN3_MCR_AWUM AWUM **/
#define CAN3_MCR_AWUM		(1 << 5)
/** CAN3_MCR_NART NART **/
#define CAN3_MCR_NART		(1 << 4)
/** CAN3_MCR_RFLM RFLM **/
#define CAN3_MCR_RFLM		(1 << 3)
/** CAN3_MCR_TXFP TXFP **/
#define CAN3_MCR_TXFP		(1 << 2)
/** CAN3_MCR_SLEEP SLEEP **/
#define CAN3_MCR_SLEEP		(1 << 1)
/** CAN3_MCR_INRQ INRQ **/
#define CAN3_MCR_INRQ		(1 << 0)

/**@}*/

