grevaillot/svd_tools/headers/STM32F7x7/can3.h
/** @defgroup can3_msr MSR master status register
@{*/

/** CAN3_MSR_RX RX **/
#define CAN3_MSR_RX		(1 << 11)
/** CAN3_MSR_SAMP SAMP **/
#define CAN3_MSR_SAMP		(1 << 10)
/** CAN3_MSR_RXM RXM **/
#define CAN3_MSR_RXM		(1 << 9)
/** CAN3_MSR_TXM TXM **/
#define CAN3_MSR_TXM		(1 << 8)
/** CAN3_MSR_SLAKI SLAKI **/
#define CAN3_MSR_SLAKI		(1 << 4)
/** CAN3_MSR_WKUI WKUI **/
#define CAN3_MSR_WKUI		(1 << 3)
/** CAN3_MSR_ERRI ERRI **/
#define CAN3_MSR_ERRI		(1 << 2)
/** CAN3_MSR_SLAK SLAK **/
#define CAN3_MSR_SLAK		(1 << 1)
/** CAN3_MSR_INAK INAK **/
#define CAN3_MSR_INAK		(1 << 0)

/**@}*/

/** @defgroup can3_tsr TSR transmit status register
@{*/

/** CAN3_TSR_LOW2 Lowest priority flag for mailbox 2 **/
#define CAN3_TSR_LOW2		(1 << 31)
/** CAN3_TSR_LOW1 Lowest priority flag for mailbox 1 **/
#define CAN3_TSR_LOW1		(1 << 30)
/** CAN3_TSR_LOW0 Lowest priority flag for mailbox 0 **/
#define CAN3_TSR_LOW0		(1 << 29)
/** CAN3_TSR_TME2 Lowest priority flag for mailbox 2 **/
#define CAN3_TSR_TME2		(1 << 28)
/** CAN3_TSR_TME1 Lowest priority flag for mailbox 1 **/
#define CAN3_TSR_TME1		(1 << 27)
/** CAN3_TSR_TME0 Lowest priority flag for mailbox 0 **/
#define CAN3_TSR_TME0		(1 << 26)

#define CAN3_TSR_CODE_SHIFT		24
#define CAN3_TSR_CODE_MASK		0x03
/** @defgroup can3_tsr_code CODE CODE
@{*/
/**@}*/

/** CAN3_TSR_ABRQ2 ABRQ2 **/
#define CAN3_TSR_ABRQ2		(1 << 23)
/** CAN3_TSR_TERR2 TERR2 **/
#define CAN3_TSR_TERR2		(1 << 19)
/** CAN3_TSR_ALST2 ALST2 **/
#define CAN3_TSR_ALST2		(1 << 18)
/** CAN3_TSR_TXOK2 TXOK2 **/
#define CAN3_TSR_TXOK2		(1 << 17)
/** CAN3_TSR_RQCP2 RQCP2 **/
#define CAN3_TSR_RQCP2		(1 << 16)
/** CAN3_TSR_ABRQ1 ABRQ1 **/
#define CAN3_TSR_ABRQ1		(1 << 15)
/** CAN3_TSR_TERR1 TERR1 **/
#define CAN3_TSR_TERR1		(1 << 11)
/** CAN3_TSR_ALST1 ALST1 **/
#define CAN3_TSR_ALST1		(1 << 10)
/** CAN3_TSR_TXOK1 TXOK1 **/
#define CAN3_TSR_TXOK1		(1 << 9)
/** CAN3_TSR_RQCP1 RQCP1 **/
#define CAN3_TSR_RQCP1		(1 << 8)
/** CAN3_TSR_ABRQ0 ABRQ0 **/
#define CAN3_TSR_ABRQ0		(1 << 7)
/** CAN3_TSR_TERR0 TERR0 **/
#define CAN3_TSR_TERR0		(1 << 3)
/** CAN3_TSR_ALST0 ALST0 **/
#define CAN3_TSR_ALST0		(1 << 2)
/** CAN3_TSR_TXOK0 TXOK0 **/
#define CAN3_TSR_TXOK0		(1 << 1)
/** CAN3_TSR_RQCP0 RQCP0 **/
#define CAN3_TSR_RQCP0		(1 << 0)

/**@}*/

/** @defgroup can3_rf0r RF0R receive FIFO 0 register
@{*/

/** CAN3_RF0R_RFOM0 RFOM0 **/
#define CAN3_RF0R_RFOM0		(1 << 5)
/** CAN3_RF0R_FOVR0 FOVR0 **/
#define CAN3_RF0R_FOVR0		(1 << 4)
/** CAN3_RF0R_FULL0 FULL0 **/
#define CAN3_RF0R_FULL0		(1 << 3)

#define CAN3_RF0R_FMP0_SHIFT		0
#define CAN3_RF0R_FMP0_MASK		0x03
/** @defgroup can3_rf0r_fmp0 FMP0 FMP0
@{*/
/**@}*/


/**@}*/

/** @defgroup can3_rf1r RF1R receive FIFO 1 register
@{*/

/** CAN3_RF1R_RFOM1 RFOM1 **/
#define CAN3_RF1R_RFOM1		(1 << 5)
/** CAN3_RF1R_FOVR1 FOVR1 **/
#define CAN3_RF1R_FOVR1		(1 << 4)
/** CAN3_RF1R_FULL1 FULL1 **/
#define CAN3_RF1R_FULL1		(1 << 3)

#define CAN3_RF1R_FMP1_SHIFT		0
#define CAN3_RF1R_FMP1_MASK		0x03
/** @defgroup can3_rf1r_fmp1 FMP1 FMP1
@{*/
/**@}*/


/**@}*/

/** @defgroup can3_ier IER interrupt enable register
@{*/

/** CAN3_IER_SLKIE SLKIE **/
#define CAN3_IER_SLKIE		(1 << 17)
/** CAN3_IER_WKUIE WKUIE **/
#define CAN3_IER_WKUIE		(1 << 16)
/** CAN3_IER_ERRIE ERRIE **/
#define CAN3_IER_ERRIE		(1 << 15)
/** CAN3_IER_LECIE LECIE **/
#define CAN3_IER_LECIE		(1 << 11)
/** CAN3_IER_BOFIE BOFIE **/
#define CAN3_IER_BOFIE		(1 << 10)
/** CAN3_IER_EPVIE EPVIE **/
#define CAN3_IER_EPVIE		(1 << 9)
/** CAN3_IER_EWGIE EWGIE **/
#define CAN3_IER_EWGIE		(1 << 8)
/** CAN3_IER_FOVIE1 FOVIE1 **/
#define CAN3_IER_FOVIE1		(1 << 6)
/** CAN3_IER_FFIE1 FFIE1 **/
#define CAN3_IER_FFIE1		(1 << 5)
/** CAN3_IER_FMPIE1 FMPIE1 **/
#define CAN3_IER_FMPIE1		(1 << 4)
/** CAN3_IER_FOVIE0 FOVIE0 **/
#define CAN3_IER_FOVIE0		(1 << 3)
/** CAN3_IER_FFIE0 FFIE0 **/
#define CAN3_IER_FFIE0		(1 << 2)
/** CAN3_IER_FMPIE0 FMPIE0 **/
#define CAN3_IER_FMPIE0		(1 << 1)
/** CAN3_IER_TMEIE TMEIE **/
#define CAN3_IER_TMEIE		(1 << 0)

/**@}*/

/** @defgroup can3_esr ESR interrupt enable register
@{*/


#define CAN3_ESR_REC_SHIFT		24
#define CAN3_ESR_REC_MASK		0xff
/** @defgroup can3_esr_rec REC REC
@{*/
/**@}*/


#define CAN3_ESR_TEC_SHIFT		16
#define CAN3_ESR_TEC_MASK		0xff
/** @defgroup can3_esr_tec TEC TEC
@{*/
/**@}*/


#define CAN3_ESR_LEC_SHIFT		4
#define CAN3_ESR_LEC_MASK		0x07
/** @defgroup can3_esr_lec LEC LEC
@{*/
/**@}*/

/** CAN3_ESR_BOFF BOFF **/
#define CAN3_ESR_BOFF		(1 << 2)
/** CAN3_ESR_EPVF EPVF **/
#define CAN3_ESR_EPVF		(1 << 1)
/** CAN3_ESR_EWGF EWGF **/
#define CAN3_ESR_EWGF		(1 << 0)

/**@}*/

/** @defgroup can3_btr BTR bit timing register
@{*/

/** CAN3_BTR_SILM SILM **/
#define CAN3_BTR_SILM		(1 << 31)
/** CAN3_BTR_LBKM LBKM **/
#define CAN3_BTR_LBKM		(1 << 30)

#define CAN3_BTR_SJW_SHIFT		24
#define CAN3_BTR_SJW_MASK		0x03
/** @defgroup can3_btr_sjw SJW SJW
@{*/
/**@}*/


#define CAN3_BTR_TS2_SHIFT		20
#define CAN3_BTR_TS2_MASK		0x07
/** @defgroup can3_btr_ts2 TS2 TS2
@{*/
/**@}*/


#define CAN3_BTR_TS1_SHIFT		16
#define CAN3_BTR_TS1_MASK		0x0f
/** @defgroup can3_btr_ts1 TS1 TS1
@{*/
/**@}*/


#define CAN3_BTR_BRP_SHIFT		0
#define CAN3_BTR_BRP_MASK		0x3ff
/** @defgroup can3_btr_brp BRP BRP
@{*/
/**@}*/


/**@}*/

/** @defgroup can3_ti0r TI0R TX mailbox identifier register
@{*/


#define CAN3_TI0R_STID_SHIFT		21
#define CAN3_TI0R_STID_MASK		0x7ff
/** @defgroup can3_ti0r_stid STID STID
@{*/
/**@}*/


#define CAN3_TI0R_EXID_SHIFT		3
#define CAN3_TI0R_EXID_MASK		0x3ffff
/** @defgroup can3_ti0r_exid EXID EXID
@{*/
/**@}*/

/** CAN3_TI0R_IDE IDE **/
#define CAN3_TI0R_IDE		(1 << 2)
/** CAN3_TI0R_RTR RTR **/
#define CAN3_TI0R_RTR		(1 << 1)
/** CAN3_TI0R_TXRQ TXRQ **/
#define CAN3_TI0R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can3_tdt0r TDT0R mailbox data length control and time stamp register
@{*/


#define CAN3_TDT0R_TIME_SHIFT		16
#define CAN3_TDT0R_TIME_MASK		0xffff
/** @defgroup can3_tdt0r_time TIME TIME
@{*/
/**@}*/

/** CAN3_TDT0R_TGT TGT **/
#define CAN3_TDT0R_TGT		(1 << 8)

#define CAN3_TDT0R_DLC_SHIFT		0
#define CAN3_TDT0R_DLC_MASK		0x0f
/** @defgroup can3_tdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can3_tdl0r TDL0R mailbox data low register
@{*/


#define CAN3_TDL0R_DATA3_SHIFT		24
#define CAN3_TDL0R_DATA3_MASK		0xff
/** @defgroup can3_tdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


