grevaillot/svd_tools/headers/STM32F7x7/can3.h
/** CAN3_F18R1_FB31 Filter bits **/
#define CAN3_F18R1_FB31		(1 << 31)
/** CAN3_F18R1_FB30 Filter bits **/
#define CAN3_F18R1_FB30		(1 << 30)
/** CAN3_F18R1_FB29 Filter bits **/
#define CAN3_F18R1_FB29		(1 << 29)
/** CAN3_F18R1_FB28 Filter bits **/
#define CAN3_F18R1_FB28		(1 << 28)
/** CAN3_F18R1_FB27 Filter bits **/
#define CAN3_F18R1_FB27		(1 << 27)
/** CAN3_F18R1_FB26 Filter bits **/
#define CAN3_F18R1_FB26		(1 << 26)
/** CAN3_F18R1_FB25 Filter bits **/
#define CAN3_F18R1_FB25		(1 << 25)
/** CAN3_F18R1_FB24 Filter bits **/
#define CAN3_F18R1_FB24		(1 << 24)
/** CAN3_F18R1_FB23 Filter bits **/
#define CAN3_F18R1_FB23		(1 << 23)
/** CAN3_F18R1_FB22 Filter bits **/
#define CAN3_F18R1_FB22		(1 << 22)
/** CAN3_F18R1_FB21 Filter bits **/
#define CAN3_F18R1_FB21		(1 << 21)
/** CAN3_F18R1_FB20 Filter bits **/
#define CAN3_F18R1_FB20		(1 << 20)
/** CAN3_F18R1_FB19 Filter bits **/
#define CAN3_F18R1_FB19		(1 << 19)
/** CAN3_F18R1_FB18 Filter bits **/
#define CAN3_F18R1_FB18		(1 << 18)
/** CAN3_F18R1_FB17 Filter bits **/
#define CAN3_F18R1_FB17		(1 << 17)
/** CAN3_F18R1_FB16 Filter bits **/
#define CAN3_F18R1_FB16		(1 << 16)
/** CAN3_F18R1_FB15 Filter bits **/
#define CAN3_F18R1_FB15		(1 << 15)
/** CAN3_F18R1_FB14 Filter bits **/
#define CAN3_F18R1_FB14		(1 << 14)
/** CAN3_F18R1_FB13 Filter bits **/
#define CAN3_F18R1_FB13		(1 << 13)
/** CAN3_F18R1_FB12 Filter bits **/
#define CAN3_F18R1_FB12		(1 << 12)
/** CAN3_F18R1_FB11 Filter bits **/
#define CAN3_F18R1_FB11		(1 << 11)
/** CAN3_F18R1_FB10 Filter bits **/
#define CAN3_F18R1_FB10		(1 << 10)
/** CAN3_F18R1_FB9 Filter bits **/
#define CAN3_F18R1_FB9		(1 << 9)
/** CAN3_F18R1_FB8 Filter bits **/
#define CAN3_F18R1_FB8		(1 << 8)
/** CAN3_F18R1_FB7 Filter bits **/
#define CAN3_F18R1_FB7		(1 << 7)
/** CAN3_F18R1_FB6 Filter bits **/
#define CAN3_F18R1_FB6		(1 << 6)
/** CAN3_F18R1_FB5 Filter bits **/
#define CAN3_F18R1_FB5		(1 << 5)
/** CAN3_F18R1_FB4 Filter bits **/
#define CAN3_F18R1_FB4		(1 << 4)
/** CAN3_F18R1_FB3 Filter bits **/
#define CAN3_F18R1_FB3		(1 << 3)
/** CAN3_F18R1_FB2 Filter bits **/
#define CAN3_F18R1_FB2		(1 << 2)
/** CAN3_F18R1_FB1 Filter bits **/
#define CAN3_F18R1_FB1		(1 << 1)
/** CAN3_F18R1_FB0 Filter bits **/
#define CAN3_F18R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can3_f18r2 F18R2 Filter bank 18 register 2
@{*/

/** CAN3_F18R2_FB31 Filter bits **/
#define CAN3_F18R2_FB31		(1 << 31)
/** CAN3_F18R2_FB30 Filter bits **/
#define CAN3_F18R2_FB30		(1 << 30)
/** CAN3_F18R2_FB29 Filter bits **/
#define CAN3_F18R2_FB29		(1 << 29)
/** CAN3_F18R2_FB28 Filter bits **/
#define CAN3_F18R2_FB28		(1 << 28)
/** CAN3_F18R2_FB27 Filter bits **/
#define CAN3_F18R2_FB27		(1 << 27)
/** CAN3_F18R2_FB26 Filter bits **/
#define CAN3_F18R2_FB26		(1 << 26)
/** CAN3_F18R2_FB25 Filter bits **/
#define CAN3_F18R2_FB25		(1 << 25)
/** CAN3_F18R2_FB24 Filter bits **/
#define CAN3_F18R2_FB24		(1 << 24)
/** CAN3_F18R2_FB23 Filter bits **/
#define CAN3_F18R2_FB23		(1 << 23)
/** CAN3_F18R2_FB22 Filter bits **/
#define CAN3_F18R2_FB22		(1 << 22)
/** CAN3_F18R2_FB21 Filter bits **/
#define CAN3_F18R2_FB21		(1 << 21)
/** CAN3_F18R2_FB20 Filter bits **/
#define CAN3_F18R2_FB20		(1 << 20)
/** CAN3_F18R2_FB19 Filter bits **/
#define CAN3_F18R2_FB19		(1 << 19)
/** CAN3_F18R2_FB18 Filter bits **/
#define CAN3_F18R2_FB18		(1 << 18)
/** CAN3_F18R2_FB17 Filter bits **/
#define CAN3_F18R2_FB17		(1 << 17)
/** CAN3_F18R2_FB16 Filter bits **/
#define CAN3_F18R2_FB16		(1 << 16)
/** CAN3_F18R2_FB15 Filter bits **/
#define CAN3_F18R2_FB15		(1 << 15)
/** CAN3_F18R2_FB14 Filter bits **/
#define CAN3_F18R2_FB14		(1 << 14)
/** CAN3_F18R2_FB13 Filter bits **/
#define CAN3_F18R2_FB13		(1 << 13)
/** CAN3_F18R2_FB12 Filter bits **/
#define CAN3_F18R2_FB12		(1 << 12)
/** CAN3_F18R2_FB11 Filter bits **/
#define CAN3_F18R2_FB11		(1 << 11)
/** CAN3_F18R2_FB10 Filter bits **/
#define CAN3_F18R2_FB10		(1 << 10)
/** CAN3_F18R2_FB9 Filter bits **/
#define CAN3_F18R2_FB9		(1 << 9)
/** CAN3_F18R2_FB8 Filter bits **/
#define CAN3_F18R2_FB8		(1 << 8)
/** CAN3_F18R2_FB7 Filter bits **/
#define CAN3_F18R2_FB7		(1 << 7)
/** CAN3_F18R2_FB6 Filter bits **/
#define CAN3_F18R2_FB6		(1 << 6)
/** CAN3_F18R2_FB5 Filter bits **/
#define CAN3_F18R2_FB5		(1 << 5)
/** CAN3_F18R2_FB4 Filter bits **/
#define CAN3_F18R2_FB4		(1 << 4)
/** CAN3_F18R2_FB3 Filter bits **/
#define CAN3_F18R2_FB3		(1 << 3)
/** CAN3_F18R2_FB2 Filter bits **/
#define CAN3_F18R2_FB2		(1 << 2)
/** CAN3_F18R2_FB1 Filter bits **/
#define CAN3_F18R2_FB1		(1 << 1)
/** CAN3_F18R2_FB0 Filter bits **/
#define CAN3_F18R2_FB0		(1 << 0)

/**@}*/

/** @defgroup can3_f19r1 F19R1 Filter bank 19 register 1
@{*/

/** CAN3_F19R1_FB31 Filter bits **/
#define CAN3_F19R1_FB31		(1 << 31)
/** CAN3_F19R1_FB30 Filter bits **/
#define CAN3_F19R1_FB30		(1 << 30)
/** CAN3_F19R1_FB29 Filter bits **/
#define CAN3_F19R1_FB29		(1 << 29)
/** CAN3_F19R1_FB28 Filter bits **/
#define CAN3_F19R1_FB28		(1 << 28)
/** CAN3_F19R1_FB27 Filter bits **/
#define CAN3_F19R1_FB27		(1 << 27)
/** CAN3_F19R1_FB26 Filter bits **/
#define CAN3_F19R1_FB26		(1 << 26)
/** CAN3_F19R1_FB25 Filter bits **/
#define CAN3_F19R1_FB25		(1 << 25)
/** CAN3_F19R1_FB24 Filter bits **/
#define CAN3_F19R1_FB24		(1 << 24)
/** CAN3_F19R1_FB23 Filter bits **/
#define CAN3_F19R1_FB23		(1 << 23)
/** CAN3_F19R1_FB22 Filter bits **/
#define CAN3_F19R1_FB22		(1 << 22)
/** CAN3_F19R1_FB21 Filter bits **/
#define CAN3_F19R1_FB21		(1 << 21)
/** CAN3_F19R1_FB20 Filter bits **/
#define CAN3_F19R1_FB20		(1 << 20)
/** CAN3_F19R1_FB19 Filter bits **/
#define CAN3_F19R1_FB19		(1 << 19)
/** CAN3_F19R1_FB18 Filter bits **/
#define CAN3_F19R1_FB18		(1 << 18)
/** CAN3_F19R1_FB17 Filter bits **/
#define CAN3_F19R1_FB17		(1 << 17)
/** CAN3_F19R1_FB16 Filter bits **/
#define CAN3_F19R1_FB16		(1 << 16)
/** CAN3_F19R1_FB15 Filter bits **/
#define CAN3_F19R1_FB15		(1 << 15)
/** CAN3_F19R1_FB14 Filter bits **/
#define CAN3_F19R1_FB14		(1 << 14)
/** CAN3_F19R1_FB13 Filter bits **/
#define CAN3_F19R1_FB13		(1 << 13)
/** CAN3_F19R1_FB12 Filter bits **/
#define CAN3_F19R1_FB12		(1 << 12)
/** CAN3_F19R1_FB11 Filter bits **/
#define CAN3_F19R1_FB11		(1 << 11)
/** CAN3_F19R1_FB10 Filter bits **/
#define CAN3_F19R1_FB10		(1 << 10)
/** CAN3_F19R1_FB9 Filter bits **/
#define CAN3_F19R1_FB9		(1 << 9)
/** CAN3_F19R1_FB8 Filter bits **/
#define CAN3_F19R1_FB8		(1 << 8)
/** CAN3_F19R1_FB7 Filter bits **/
#define CAN3_F19R1_FB7		(1 << 7)
/** CAN3_F19R1_FB6 Filter bits **/
#define CAN3_F19R1_FB6		(1 << 6)
/** CAN3_F19R1_FB5 Filter bits **/
#define CAN3_F19R1_FB5		(1 << 5)
/** CAN3_F19R1_FB4 Filter bits **/
#define CAN3_F19R1_FB4		(1 << 4)
/** CAN3_F19R1_FB3 Filter bits **/
#define CAN3_F19R1_FB3		(1 << 3)
/** CAN3_F19R1_FB2 Filter bits **/
#define CAN3_F19R1_FB2		(1 << 2)
/** CAN3_F19R1_FB1 Filter bits **/
#define CAN3_F19R1_FB1		(1 << 1)
/** CAN3_F19R1_FB0 Filter bits **/
#define CAN3_F19R1_FB0		(1 << 0)

/**@}*/

